[
  {
    "company": "Levergy",
    "year": "2014",
    "position": "Art Director",
    "blurb": "At Levergy I worked as an Art Director on the SuperSport Social Media account. SuperSport is Africa's largest sports broadcaster and their social media reach is in the millions. I was responsible for all graphics produced across all their social media platforms. (Screencap from 2018, ie: not my work)",
    "link": "http://www.levergy.co.za/",
    "img": "./assets/levergy.png"
  },
  {
    "company": "Maven Agency",
    "year": "2015",
    "position": "UI Designer",
    "blurb": "At Maven I cut my teeeth as a UI designer after making the jump from graphic design. I worked on several large web projects in my time there and learnt a great deal about designing for web. I discovered Sketch while working there! (Yes, we were using Photoshop back then :P)",
    "link": "http://www.mavenagency.co.za/",
    "img": "./assets/trinity.png"
  },
  {
    "company": "Barclays Africa",
    "year": "2015 - 2016",
    "position": "Product Designer",
    "blurb": "Barclays Africa/Absa is Africa's biggest bank, serving millions of customers throughout the continent. I worked on numerous projects here, most of which are still under NDA. My main responsibility was leading product design on what was then called Switch FX (now called NovoFX), which allowed customers to handle foreign payments without visiting a branch.",
    "link": "https://www.barclaysafrica.com/barclaysafrica/",
    "img": "./assets/barclays.png"
  },
  {
    "company": "Fuse",
    "year": "2016 - 2018",
    "position": "Lead Product Designer",
    "blurb": "In 2016 I moved to Oslo, Norway to take on an enormous challenge at Fuse. I currently lead product design on Fuse Studio (now open sourced), a Windows/macOS application for building iOS and Android apps.",
    "link": "https://www.fusetools.com/",
    "img": "./assets/fuse.png"
  },
  {
    "company": "The Fucking Weather",
    "year": "2018",
    "position": "Designer, Developer",
    "blurb": "A weather app for people who hate weather apps. I built The F*cking Weather as a bit of fun, to teach myself more about building applications that handle live data.",
    "link": "./tfw.html",
    "img": "./assets/tfw.png"
  },
  {
    "company": "Rhodes University",
    "year": "2014",
    "position": "Bachelor of Journalism & Media Studies 🙄",
    "blurb": "I studied journalism at Rhodes University with a specialisation in photo-journalism. The course also had various intensives modules, including new media(html,css), design, radio and film-making",
    "link": "https://www.ru.ac.za/jms/",
    "img": "./assets/rhodes-university.png"
  },
  {
    "company": "TIDAL",
    "year": "2018 - Present",
    "position": "Product Designer",
    "blurb": "In mid 2018 I joined TIDAL as a product designer working across their entire range of products, including but not limited to iOS, Android, Web/Desktop and TV.",
    "link": "https://listen.tidal.com/",
    "img": "./assets/tidal.png"
  }
]
